In [1]:
import numpy as np
from pandas import Series, DataFrame

In [2]:
ser1 = Series([1,2, 3, 4, 1, 2, 3, 4])

In [3]:
ser1

0    1
1    2
2    3
3    4
4    1
5    2
6    3
7    4
dtype: int64

In [5]:
# 1をnanに置換する
ser1.replace(1, np.nan)

0    NaN
1    2.0
2    3.0
3    4.0
4    NaN
5    2.0
6    3.0
7    4.0
dtype: float64

In [6]:
# 元のデータはそのまま
ser1

0    1
1    2
2    3
3    4
4    1
5    2
6    3
7    4
dtype: int64

In [7]:
# 複数データを一気に置換
ser1.replace([1, 4], [100, 400])

0    100
1      2
2      3
3    400
4    100
5      2
6      3
7    400
dtype: int64

In [9]:
# 辞書型でも渡せる
ser1.replace({4: np.nan})

0    1.0
1    2.0
2    3.0
3    NaN
4    1.0
5    2.0
6    3.0
7    NaN
dtype: float64

In [12]:
df = DataFrame(np.arange(25).reshape((5, 5)), columns=['A', 'B', 'C', 'D', 'E'])

In [13]:
df

    A   B   C   D   E
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24

In [15]:
df.replace(1, 100)

    A    B   C   D   E
0   0  100   2   3   4
1   5    6   7   8   9
2  10   11  12  13  14
3  15   16  17  18  19
4  20   21  22  23  24

In [16]:
df

    A   B   C   D   E
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24

In [17]:
# 元のデータを変更
df.replace([1, 2], [100, 200], inplace=True)

In [18]:
df

    A    B    C   D   E
0   0  100  200   3   4
1   5    6    7   8   9
2  10   11   12  13  14
3  15   16   17  18  19
4  20   21   22  23  24

In [26]:
df['A'] = 1

In [27]:
df

   A    B    C   D   E
0  1  100  200   3   4
1  1    6    7   8   9
2  1   11   12  13  14
3  1   16   17  18  19
4  1   21   22  23  24